RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/csi_reg.h
struct csi_reg {
    /* 0x0 : mipi_config */
    union {
        struct {
            uint32_t cr_csi_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_lane_num     : 1;  /* [    1],        r/w,        0x1 */
            uint32_t rsvd_2          : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t cr_lane_inv     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_data_bit_inv : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_sync_sp_en   : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_unpack_en    : 1;  /* [    6],        r/w,        0x1 */
            uint32_t reserved_7_11   : 5;  /* [11: 7],       rsvd,        0x0 */
            uint32_t cr_vc_dvp0      : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t cr_vc_dvp1      : 2;  /* [15:14],        r/w,        0x1 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_config;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[12];

    /* 0x10 : csi_int_status */
    union {
        struct {
            uint32_t csi_int_status : 6;  /* [ 5: 0],          r,        0x0 */
            uint32_t reserved_6_31  : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } csi_int_status;

    /* 0x14 : csi_int_mask */
    union {
        struct {
            uint32_t csi_int_mask  : 6;  /* [ 5: 0],        r/w,       0x3f */
            uint32_t reserved_6_31 : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } csi_int_mask;

    /* 0x18 : csi_int_clear */
    union {
        struct {
            uint32_t csi_int_clear : 6;  /* [ 5: 0],        w1p,        0x0 */
            uint32_t reserved_6_31 : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } csi_int_clear;

    /* 0x1C : csi_int_enable */
    union {
        struct {
            uint32_t csi_int_enable : 6;  /* [ 5: 0],        r/w,       0x3f */
            uint32_t reserved_6_31  : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } csi_int_enable;

    /* 0x20 : gnr_buf_status */
    union {
        struct {
            uint32_t st_gnr_fifo_cnt : 4;  /* [ 3: 0],          r,        0x0 */
            uint32_t reserved_4_31   : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gnr_buf_status;

    /* 0x24 : gnr_buf_rdata */
    union {
        struct {
            uint32_t gnr_buf_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } gnr_buf_rdata;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[88];

    /* 0x80 : dphy_config_0 */
    union {
        struct {
            uint32_t dl0_enable        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dl1_enable        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cl_enable         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3        : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t dl0_stopstate     : 1;  /* [    4],          r,        0x1 */
            uint32_t dl1_stopstate     : 1;  /* [    5],          r,        0x1 */
            uint32_t cl_stopstate      : 1;  /* [    6],          r,        0x1 */
            uint32_t reserved_7        : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t dl0_ulpsactivenot : 1;  /* [    8],          r,        0x1 */
            uint32_t dl1_ulpsactivenot : 1;  /* [    9],          r,        0x1 */
            uint32_t cl_ulpsactivenot  : 1;  /* [   10],          r,        0x1 */
            uint32_t reserved_11       : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t dl0_forcerxmode   : 1;  /* [   12],        r/w,        0x0 */
            uint32_t dl1_forcerxmode   : 1;  /* [   13],        r/w,        0x0 */
            uint32_t cl_rxclkactivehs  : 1;  /* [   14],          r,        0x0 */
            uint32_t cl_rxulpsclknot   : 1;  /* [   15],          r,        0x1 */
            uint32_t reserved_16_30    : 15; /* [30:16],       rsvd,        0x0 */
            uint32_t csi_reset_n       : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_0;

    /* 0x84 : dphy_config_1 */
    union {
        struct {
            uint32_t reg_time_ck_settle  : 8; /* [ 7: 0],        r/w,        0xa */
            uint32_t reg_time_ck_term_en : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t reg_time_hs_settle  : 8; /* [23:16],        r/w,       0x2f */
            uint32_t reg_time_hs_term_en : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } dphy_config_1;

    /* 0x88 : dphy_config_2 */
    union {
        struct {
            uint32_t reg_ana_lprxen_clk      : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_ana_hsrxen_clk      : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_ana_hsrx_stop_state : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_ana_hsrx_sync_en    : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reg_ana_lprxen          : 2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t reg_ana_hsrxen          : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_ana_term_en         : 5; /* [14:10],        r/w,        0x0 */
            uint32_t reg_ana_test_en         : 1; /* [   15],        r/w,        0x0 */
            uint32_t reg_pt_lock_counter     : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_pt_prbs_or_jitt     : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_pt_lp_mode          : 1; /* [   21],        r/w,        0x0 */
            uint32_t reg_pt_en               : 1; /* [   22],        r/w,        0x0 */
            uint32_t reg_pt_lock             : 1; /* [   23],          r,        0x0 */
            uint32_t reg_pt_pass             : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31          : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_2;

    /* 0x8C : dphy_config_3 */
    union {
        struct {
            uint32_t reg_csi_ana_1 : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_csi_ana_0 : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_3;

    /* 0x90 : dphy_config_4 */
    union {
        struct {
            uint32_t reg_csi_dc_tp_out_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_csi_pw_avdd1815  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31        : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_4;

    /* 0x94 : dphy_config_5 */
    union {
        struct {
            uint32_t reg_csi_byte_clk_inv : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_csi_ddr_clk_inv  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31        : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_5;

    /* 0x98  reserved */
    uint8_t RESERVED0x98[100];

    /* 0xFC : dummy_reg */
    union {
        struct {
            uint32_t dummy_reg : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dummy_reg;
};

typedef volatile struct csi_reg csi_reg_t;

#endif /* __CSI_REG_H__ */
